{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "tuneai/Meta-Llama-3-8B",
  "bias": "none",
  "fan_in_fan_out": null,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 32,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "o_proj",
    "gate_proj",
    "down_proj",
    "q_proj",
    "up_proj",
    "k_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}